people/nguyenthanhvuh/old/posts/oh-my-soundness.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Soundness, Completeness, Recall, Precision, Static and Dynamic Analyses">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Oh My Soundness</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">20 Sep 2022</div><h1 class="post-title"><a href="./oh-my-soundness.html">Oh My Soundness</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org10e8f6f">1. Summarization of Mike's post</a>
<ul>
<li><a href="#org06a0876">1.1. Mathematical Logic</a></li>
<li><a href="#org79a4d82">1.2. Static Analysis</a>
<ul>
<li><a href="#orgf98772c">1.2.1. Soundiness</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc9ac287">2. Extension to Dynamic Analysis</a></li>
</ul>
</div>
</nav>
<p>
Our <a href="https://dynaroars.github.io/">Dynaroars</a> group (Didier, Hai, Linhan, and Vu) <a href="https://github.com/dynaroars/dynaroars.github.io/wiki/Weekly-Meetings">recently</a> read Mike Hick's post on <a href="http://www.pl-enthusiast.net/2017/10/23/what-is-soundness-in-static-analysis/">soundness in static analysis</a>.  It was a really good read as Mike made it easy to follow and understand these common, yet confusing definitions and terminologies.  We also had a good discussion on how these definitions from static analysis would apply to dynamic analysis (e.g., testing). Below is our summarization.
</p>

<div id="outline-container-org10e8f6f" class="outline-2">
<h2 id="org10e8f6f"><span class="section-number-2">1.</span> Summarization of Mike's post</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org06a0876" class="outline-3">
<h3 id="org06a0876"><span class="section-number-3">1.1.</span> Mathematical Logic</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First is the definitions of soudness and completeness of from mathematical logic.  These properties are applied to a proof system <code>T</code>, which takes in a statement (i.e., a logical formula) <code>s</code> and either proves or disproves that statement. 
</p>

<ul class="org-ul">
<li>soundness (<code>T</code> is sound):: if <code>T</code> provides a proof of <code>s</code>, then <code>s</code> is indeed true.</li>
<li>completeness (<code>T</code> is complete):: if <code>s</code> is true, then <code>T</code> provides a proof for <code>s</code>.</li>
</ul>

<p>
In other words, <code>T</code> is sound if things that it proves are indeed true (equivalently, if <code>T</code> only proves true things), and that <code>T</code> is complete if it can prove any true statements.
</p>

<p>
<b>Thoughts</b>: Intuitively we can see that being <b>sound</b> (my proofs are correct) seems easier to achieve than being <b>complete</b> (I can prove any things that are true, e.g., I can give a statement representing Fermat's last theorem and expect the machine to throw out a complete proof)<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.  Of course we know by now it is <i>possible</i> to have a proof system that is both sound and complete for proposition logic (Completeness Theorem) but it is not possible to have such a system in first-order logic (Incompleteness theorem).
</p>
</div>
</div>



<div id="outline-container-org79a4d82" class="outline-3">
<h3 id="org79a4d82"><span class="section-number-3">1.2.</span> Static Analysis</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now let's adapt these definitions to static analysis. Let's assume we want to use a static verifier <code>T</code> to check if a program <code>S</code> has some desirable property <code>R</code> (e.g., does not have division by 0). 
For simplicity, we assume <code>T</code> either <code>proves</code> or <code>disproves</code> that <code>S</code> has <code>R</code> (in practice, most tools also return <code>unknown</code> indicating <code>T</code> cannot handle the <code>S</code> or <code>R</code> or times out). Morover, when <code>T</code> disproves that <code>S</code> has <code>R</code>, it also returns a counterexample (<code>cex</code>), which typically is an input causing <code>S</code> to violate <code>R</code> (causing <code>S</code> to perform a div-by-0 operation).
</p>

<dl class="org-dl">
<dt>soundness (<code>T</code> is sound)</dt><dd><p>
<b>if</b> <code>T</code> proves that a <code>S</code> has <code>R</code>, <b>then</b> <code>S</code> has <code>R</code>.
</p>

<p>
For example, if the verifier says the program is safe of div-by-0 error, then the program trully does not have that error.)
</p></dd>

<dt>completeness (<code>T</code> is complete)</dt><dd><p>
<b>if</b> <code>S</code> has <code>R</code>, <b>then</b> <code>T</code> proves that <code>S</code> has <code>R</code>.
</p>

<p>
For example, if the program is safe of div-by-0 error, then <code>T</code> proves that.
</p></dd>
</dl>

<p>
<b>Thoughts</b>: We often talk about how algorithms and tools often sacrifice completeness for soundness, so let's define unsound and incomplete properties. We can do this by just negating the definitions of soundness of completeness above.
</p>

<dl class="org-dl">
<dt>unsound</dt><dd><p>
<code>T</code> proves that a <code>S</code> has <code>R</code> <b>but</b> <code>S</code> <i>does not</i> has <code>R</code>.
</p>

<p>
For example, the verifier proves the program is safe of div-by-0 error, but the program has that error.
</p></dd>

<dt>incomplete</dt><dd><p>
<code>S</code>  has <code>R</code> but <code>T</code> disproves that <code>S</code> has <code>R</code>.
</p>

<p>
For example, the program is safe of  div-by-0 error,  <code>T</code> says that it has that error (and provides a counterexample for that).
</p>

<p>
So on one hand, unsound gives us a false confidence that our program is safe or has some desirable property while it does not. On the other hand, soundness gives us a false warning (and spurious counterexample) claiming our program is unsafe or does not satisfy some property while it does. 
</p></dd>
</dl>
</div>




<div id="outline-container-orgf98772c" class="outline-4">
<h4 id="orgf98772c"><span class="section-number-4">1.2.1.</span> Soundiness</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Achieving both soundness and completeness is usually not possible. Requiring just one of them might not mean much, e.g., a  tool that never proves anything is always sound and a tool that disproves everything is always complete. In general we want soundness, but not the kind of soundness that never proves anything. 
</p>


<dl class="org-dl">
<dt>soundiness</dt><dd></dd>
</dl>

<p>
Finally, <code>precision</code> and <code>recall</code> can be used as a metrics for soundness and completeness.  Let \(N\) be the set of programs we want to analyze using a static tool, \(X \subseteq N\) the set of programs that have the property of interest, \(N-X\) the set of programs that do not have the proeprty of interst.  Moreover, let \(T \subseteq X\) be the set of programs that are (correctly) proved by the tool, and \(F \subseteq (N - X)\) the set of programs that are (incorrectly) proved the the tool.  Then,
</p>

<p>
The static analysis's <code>precision</code> and <code>recall</code> are
</p>

<dl class="org-dl">
<dt>precision</dt><dd>\(\frac{|T|}{|T| + |F|}\)</dd>
</dl>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc9ac287" class="outline-2">
<h2 id="orgc9ac287"><span class="section-number-2">2.</span> Extension to Dynamic Analysis</h2>
<div class="outline-text-2" id="text-2">
<p>
Mike's post focuses on static analysis analysis (e.g., a verification
tool).  Does it then apply to dynamic analysis (e.g., a testing tool)?
We often hear that static and dynamic analyses compliment one another,
e.g., <i>verification proves the absense of error while testing proves
the existence (through valid counterexamples)</i>.  Moreover, we hear that
static approaches aim to be sound, but not complete, then does that
mean dynamic and testing techniques aim for completeness but not
sound? How is being complete related to not producing spurious counterexamples and all that?
</p>

<p>
At first glance, it seems the definition of completeness above (if a program has a property then the tool can prove that) does not apply to the ability to find bugs and not producing spurious counterexamples. However, it does as shown below.
</p>

<p>
The completeness definition above says that  "<b>if</b> <code>S</code> has <code>R</code>, <b>then</b> <code>T</code> proves that <code>S</code> has <code>R</code>".
Let <code>S</code> has <code>R</code> be represented by a statement <code>A</code> and <code>T</code> proves that <code>S</code> has <code>R</code> represented by a statement <code>B</code>. Then we have 
</p>

<pre class="example">
A =&gt; B # completeness
= !A V B  
= B V !A
= !B =&gt; !A
</pre>

<p>
Thus we have an equivalent definition for completeness of static analysis that makes sense for testing
</p>

<dl class="org-dl">
<dt>completeness</dt><dd><b>if</b> <code>T</code> disproves that <code>S</code> has <code>R</code> <b>then</b> <code>S</code> does not have <code>R</code>.</dd>
</dl>

<p>
In other words, if a testing tool finds an input to a program that violate the property, then that really means the property is not valid in the program. This makes sense for dynamic analysis and testing because indeed we expect that when a testing tool finds a violation, it is actually a violation (because testing actually runs the program and thus can observe that bugs actually occured).
</p>

<p>
Similarly, we do the same for soundness
</p>

<pre class="example">
B =&gt; A # soundness
= !B V A  
= A V !B
= !A =&gt; !B
</pre>

<dl class="org-dl">
<dt>soundness</dt><dd><b>if</b>  <code>S</code> does not have <code>R</code> <b>then</b> <code>T</code> disproves that <code>S</code> has <code>R</code>.</dd>
</dl>


<p>
So this means that dynamic analysis and testing are indeed complete ().
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara"></p></div></div>


</div>
</div><div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-program-analysis.html">program-analysis</a> <a href="./tag-notes.html">notes</a> <a href="./tag-static-analysis.html">static-analysis</a> <a href="./tag-dynamic-analysis.html">dynamic-analysis</a> <a href="./tag-blog.html">blog</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
